app/controllers/school_classes_controller.rb

INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Social Studies"], ["room_number", 202], ["created_at", "2020-07-29 22:29:48.799331"], ["updated_at", "2020-07-29 22:29:48.799331"]]
---
  def create
    @school_class = SchoolClass.new(school_classes_params(:title, :room_number))
    @school_class.save

UPDATE "school_classes" SET "title" = ?, "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", "Risk Analysis"], ["room_number", 10], ["updated_at", "2019-03-12 03:37:41.624605"], ["id", 1]]
---
  def update
    set_school_classes
    @school_class.update(school_classes_params(:title, :room_number))

SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
  def set_school_classes
    @school_class = SchoolClass.find(params[:id])